kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        if (ImGui::BeginMenu("View")) {
            ImGui::MenuItem("File Explorer", nullptr, &show_file_explorer_);
            ImGui::MenuItem("Properties Panel", nullptr, &show_properties_panel_);
            ImGui::MenuItem("AI Assistant", nullptr, &show_ai_assistant_);
            ImGui::EndMenu();
        }
        
        if (ImGui::BeginMenu("Tools")) {
            if (ImGui::MenuItem("Compile", "Ctrl+R")) {
                CompileCode();
            }
            if (ImGui::MenuItem("Upload", "Ctrl+U")) {
                UploadCode();
            }
            ImGui::EndMenu();
        }
        
        if (ImGui::BeginMenu("Help")) {
            if (ImGui::MenuItem("About")) {
                AddConsoleMessage("ESP32 Driver IDE v1.0.0 - Built with ImGui");
            }
            ImGui::EndMenu();
        }
        
        ImGui::EndMainMenuBar();
    }
}

void ImGuiWindow::RenderToolbar() {
    ImGuiViewport* viewport = ImGui::GetMainViewport();
    ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + 19)); // After menu bar
    ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, 60));
    
    ImGui::Begin("Toolbar", nullptr, ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | 
                                     ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoScrollbar);
    
    // USB Port selector
    ImGui::Text("USB Port:");
    ImGui::SameLine();
    ImGui::SetNextItemWidth(150);
    if (ImGui::BeginCombo("##port", selected_port_.empty() ? "No port" : selected_port_.c_str())) {
        for (size_t i = 0; i < available_ports_.size(); i++) {
            bool is_selected = (selected_port_index_ == static_cast<int>(i));
            if (ImGui::Selectable(available_ports_[i].c_str(), is_selected)) {
                selected_port_index_ = i;
                selected_port_ = available_ports_[i];
                AddConsoleMessage("Selected port: " + selected_port_);
            }
            if (is_selected)
                ImGui::SetItemDefaultFocus();
        }
        ImGui::EndCombo();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Refresh Ports")) {
        RefreshPortList();
        AddConsoleMessage("Refreshed device list - found " + std::to_string(available_ports_.size()) + " device(s)");
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Baud rate
    ImGui::Text("Baud:");
    ImGui::SameLine();
    ImGui::SetNextItemWidth(100);
    if (ImGui::BeginCombo("##baud", std::to_string(selected_baud_rate_).c_str())) {
        for (int baud : baud_rates_) {
            bool is_selected = (selected_baud_rate_ == baud);
            if (ImGui::Selectable(std::to_string(baud).c_str(), is_selected)) {
                selected_baud_rate_ = baud;
            }
            if (is_selected)
                ImGui::SetItemDefaultFocus();
        }
        ImGui::EndCombo();
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Connect/Disconnect button with status
    if (!is_connected_) {
        if (ImGui::Button("Connect")) {
            ConnectToDevice();
        }
    } else {
        if (ImGui::Button("Disconnect")) {
            DisconnectFromDevice();
        }
    }
    
    // Show connection status
    if (connection_attempted_) {
        ImGui::SameLine();
        if (is_connected_) {
            ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
        } else {
            ImGui::TextColored(ImVec4(1.0f, 0.0f, 0.0f, 1.0f), "✗ Failed");
        }
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Action buttons
    if (ImGui::Button("Upload")) {
        UploadCode();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Download")) {
        DownloadFirmware();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Debug")) {
        DebugCode();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("RE")) {
        ReverseEngineerCode();
        current_center_tab_ = 2; // Switch to RE tab
    }
    
    ImGui::End();
}

void ImGuiWindow::RenderFileExplorer() {
    ImGui::Text("File Explorer");
    ImGui::Separator();
    
    if (ImGui::Button("New File")) {
        // Create new editor tab
        EditorTab new_tab;
        new_tab.filename = "sketch_" + std::to_string(editor_tabs_.size() + 1) + ".ino";
        new_tab.content = SIMPLE_SKETCH_TEMPLATE;
        new_tab.is_modified = false;
        std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
        editor_tabs_.push_back(new_tab);
        active_editor_tab_ = editor_tabs_.size() - 1;
        RefreshFileList();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("New Folder")) {
        FileNode new_folder;
        new_folder.name = "NewFolder";
        new_folder.path = "/NewFolder";
        new_folder.is_folder = true;
        root_folder_.children.push_back(new_folder);
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Refresh")) {
        RefreshFileList();
    }
    
    ImGui::Separator();
    
    // Render hierarchical file tree
    RenderFileNode(root_folder_, "");
}

void ImGuiWindow::RenderCenterPanel() {
    if (ImGui::BeginTabBar("CenterTabs")) {
        if (ImGui::BeginTabItem("Editor")) {
            current_center_tab_ = 0;
            RenderEditorTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Debugger")) {
            current_center_tab_ = 1;
            RenderDebuggerTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Reverse Engineering")) {
            current_center_tab_ = 2;
            RenderReverseEngineeringTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Blueprint")) {
            current_center_tab_ = 3;
            RenderBlueprintTab();
            ImGui::EndTabItem();
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderEditorTab() {
    // Multi-tab editor
    if (editor_tabs_.empty()) {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No files open. Create a new file or open an existing one.");
        return;
    }
    
    if (ImGui::BeginTabBar("EditorTabs", ImGuiTabBarFlags_Reorderable | ImGuiTabBarFlags_AutoSelectNewTabs)) {
        for (size_t i = 0; i < editor_tabs_.size(); i++) {
            bool open = true;
            std::string tab_label = editor_tabs_[i].filename;
            if (editor_tabs_[i].is_modified) {
                tab_label += "*";
            }
            
