kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
void ImGuiWindow::RenderReverseEngineeringTab() {
    ImGui::Text("Reverse Engineering Tools");
    ImGui::Separator();
    
    // Display available devices list - helps users see all detected devices at a glance
    ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Available Devices:");
    ImGui::Spacing();
    
    if (available_ports_.empty()) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No devices found");
        ImGui::TextWrapped("Click 'Refresh Ports' in the toolbar to scan for devices.");
    } else {
        ImGui::BeginChild("DeviceList", ImVec2(0, 100), true);
        for (size_t i = 0; i < available_ports_.size(); i++) {
            bool is_current = (available_ports_[i] == selected_port_);
            bool is_connected = is_current && is_connected_;
            
            if (is_connected) {
                ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ %s (Connected)", available_ports_[i].c_str());
            } else if (is_current) {
                ImGui::TextColored(ImVec4(1.0f, 1.0f, 0.0f, 1.0f), "○ %s (Selected)", available_ports_[i].c_str());
            } else {
                ImGui::Text("  %s", available_ports_[i].c_str());
            }
        }
        ImGui::EndChild();
        
        ImGui::TextWrapped("Found %u device(s). Select and connect to a device from the toolbar.", 
                           static_cast<unsigned int>(available_ports_.size()));
    }
    
    ImGui::Separator();
    ImGui::Spacing();
    
    // Check connection status
    if (!is_connected_) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No device connected");
        ImGui::TextWrapped("Please connect to a device using the toolbar before reverse engineering.");
        ImGui::Spacing();
        if (ImGui::Button("Go to Toolbar")) {
            AddConsoleMessage("Use the Connect button in the toolbar to connect to your ESP32 device");
        }
        return;
    }
    
    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Device connected: %s", selected_port_.c_str());
    ImGui::Spacing();
    
    if (ImGui::Button("Analyze Binary")) {
        ReverseEngineerCode();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Disassemble")) {
        AddConsoleMessage("=== Disassembling Firmware ===");
        AddConsoleMessage("Reading flash memory from device...");
        AddConsoleMessage("Parsing instruction set...");
        AddConsoleMessage("Identifying function boundaries...");
        
        // Populate disassembly data with sample ESP32 Xtensa instructions
        // In a real implementation, this would read from the actual device flash
        re_disassembly_data_ = SAMPLE_DISASSEMBLY_DATA;
        
        re_disassembly_performed_ = true;
        AddConsoleMessage("✓ Disassembly complete - " + std::to_string(re_disassembly_data_.size()) + " instructions decoded");
    }
    
    ImGui::Separator();
    ImGui::Text("Analysis Results:");
    
    ImGui::BeginChild("REResults", ImVec2(0, 0), true);
    
    // Display analysis results if available, otherwise show prompt
    if (re_analysis_performed_ && re_analysis_result_.has_data) {
        ImGui::TextWrapped("ESP32 Firmware Analysis:");
        ImGui::BulletText("Architecture: %s", re_analysis_result_.architecture.c_str());
        ImGui::BulletText("Flash size: %s", re_analysis_result_.flash_size.c_str());
        ImGui::BulletText("Entry point: %s", re_analysis_result_.entry_point.c_str());
        ImGui::BulletText("Functions detected: %d", re_analysis_result_.functions_detected);
        ImGui::BulletText("Strings found: %d", re_analysis_result_.strings_found);
        
        // Show disassembly if it has been performed
        if (re_disassembly_performed_ && !re_disassembly_data_.empty()) {
            ImGui::Spacing();
            ImGui::Separator();
            ImGui::Spacing();
            ImGui::TextWrapped("Disassembly Output:");
            for (const auto& line : re_disassembly_data_) {
                ImGui::TextUnformatted(line.c_str());
            }
        }
    } else {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No analysis data available yet.");
        ImGui::TextWrapped("Click 'Analyze Binary' to perform firmware analysis or 'Disassemble' to view disassembled code.");
    }
    
    ImGui::EndChild();
}

void ImGuiWindow::RenderPropertiesPanel() {
    if (ImGui::BeginTabBar("PropertiesTabs")) {
        if (ImGui::BeginTabItem("Editor")) {
            ImGui::Text("File Info:");
            if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
                const auto& tab = editor_tabs_[active_editor_tab_];
                ImGui::BulletText("Name: %s", tab.filename.c_str());
                ImGui::BulletText("Size: %zu bytes", tab.content.size());
                
                // Calculate line count only when content changes
                if (line_count_dirty_) {
                    cached_line_count_ = static_cast<int>(std::count(tab.content.begin(), tab.content.end(), '\n') + 1);
                    line_count_dirty_ = false;
                }
                ImGui::BulletText("Lines: %d", cached_line_count_);
                ImGui::BulletText("Modified: %s", tab.is_modified ? "Yes" : "No");
            } else {
                ImGui::TextDisabled("No file loaded");
            }
            
            ImGui::Separator();
            ImGui::Text("Editor Settings:");
            
            static bool show_line_numbers = true;
            static bool auto_indent = true;
            
            ImGui::Checkbox("Show line numbers", &show_line_numbers);
            ImGui::Checkbox("Auto indent", &auto_indent);
            ImGui::Checkbox("Syntax highlighting", &enable_syntax_highlighting_);
            
            ImGui::Separator();
            ImGui::Text("Board Config:");
            
            static int board_type = 0;
            const char* board_types[] = { "ESP32", "ESP32-S2", "ESP32-S3", "ESP32-C3" };
            ImGui::Combo("Board", &board_type, board_types, IM_ARRAYSIZE(board_types));
            
