kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
            static int freq = 240;
            ImGui::SliderInt("CPU Freq (MHz)", &freq, 80, 240);
            
            if (ImGui::Button("Apply Settings")) {
                AddConsoleMessage("Settings applied");
            }
            
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Templates")) {
            ImGui::Text("Code Templates");
            ImGui::Separator();
            
            if (file_manager_) {
                auto templates = file_manager_->GetTemplates();
                
                if (templates.empty()) {
                    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No templates available");
                } else {
                    ImGui::Text("Available templates: %zu", templates.size());
                    ImGui::Spacing();
                    
                    ImGui::BeginChild("TemplateList", ImVec2(0, -30), true);
                    for (const auto& tmpl : templates) {
                        ImGui::PushID(tmpl.name.c_str());
                        
                        ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "%s", tmpl.name.c_str());
                        ImGui::TextWrapped("%s", tmpl.description.c_str());
                        
                        if (ImGui::Button("Insert")) {
                            auto code = file_manager_->ApplyTemplate(tmpl.name, {});
                            if (!code.empty()) {
                                InsertCodeIntoEditor(code);
                            }
                        }
                        
                        ImGui::Separator();
                        ImGui::PopID();
                    }
                    ImGui::EndChild();
                }
            } else {
                ImGui::TextDisabled("File manager not available");
            }
            
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Completion")) {
            ImGui::Text("Code Completion");
            ImGui::Separator();
            
            ImGui::TextWrapped("Available code completion features:");
            ImGui::Spacing();
            
            if (ImGui::CollapsingHeader("GPIO Functions")) {
                if (ImGui::Button("pinMode()")) {
                    InsertCodeIntoEditor("pinMode(pin, mode);");
                }
                if (ImGui::Button("digitalWrite()")) {
                    InsertCodeIntoEditor("digitalWrite(pin, value);");
                }
                if (ImGui::Button("digitalRead()")) {
                    InsertCodeIntoEditor("digitalRead(pin);");
                }
                if (ImGui::Button("analogRead()")) {
                    InsertCodeIntoEditor("analogRead(pin);");
                }
            }
            
            if (ImGui::CollapsingHeader("Serial Functions")) {
                if (ImGui::Button("Serial.begin()")) {
                    InsertCodeIntoEditor("Serial.begin(115200);");
                }
                if (ImGui::Button("Serial.println()")) {
                    InsertCodeIntoEditor("Serial.println(\"message\");");
                }
                if (ImGui::Button("Serial.print()")) {
                    InsertCodeIntoEditor("Serial.print(\"message\");");
                }
            }
            
            if (ImGui::CollapsingHeader("WiFi Functions")) {
                if (ImGui::Button("WiFi.begin()")) {
                    InsertCodeIntoEditor("WiFi.begin(ssid, password);");
                }
                if (ImGui::Button("WiFi.status()")) {
                    InsertCodeIntoEditor("WiFi.status();");
                }
                if (ImGui::Button("WiFi.localIP()")) {
                    InsertCodeIntoEditor("WiFi.localIP();");
                }
            }
            
            if (ImGui::CollapsingHeader("Timing Functions")) {
                if (ImGui::Button("delay()")) {
                    InsertCodeIntoEditor("delay(1000);");
                }
                if (ImGui::Button("millis()")) {
                    InsertCodeIntoEditor("millis();");
                }
                if (ImGui::Button("micros()")) {
                    InsertCodeIntoEditor("micros();");
                }
            }
            
            ImGui::EndTabItem();
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderConsole() {
    ImGui::Text("Console Output");
    ImGui::Separator();
    
    ImGui::BeginChild("ConsoleScrolling", ImVec2(0, -30), false, ImGuiWindowFlags_HorizontalScrollbar);
    
    for (const auto& message : console_messages_) {
        ImGui::TextWrapped("%s", message.c_str());
    }
    
    if (scroll_to_bottom_) {
        ImGui::SetScrollHereY(1.0f);
        scroll_to_bottom_ = false;
    }
    
    ImGui::EndChild();
    
    ImGui::Separator();
    if (ImGui::Button("Clear Console")) {
        console_messages_.clear();
    }
}

void ImGuiWindow::RefreshFileList() {
    file_list_.clear();
    
    if (file_manager_) {
        file_list_ = file_manager_->GetFileList();
    }
    
    // Initialize file tree structure if empty
    if (root_folder_.children.empty()) {
        // Create a sample project structure
        FileNode main_folder;
        main_folder.name = "src";
        main_folder.path = "/src";
        main_folder.is_folder = true;
        
        FileNode sketch_file;
        sketch_file.name = "sketch.ino";
        sketch_file.path = "/src/sketch.ino";
        sketch_file.is_folder = false;
        main_folder.children.push_back(sketch_file);
        
        FileNode config_file;
        config_file.name = "config.h";
        config_file.path = "/src/config.h";
        config_file.is_folder = false;
        main_folder.children.push_back(config_file);
        
        root_folder_.children.push_back(main_folder);
        
        // Add some files in root
        FileNode readme;
        readme.name = "README.md";
        readme.path = "/README.md";
        readme.is_folder = false;
        root_folder_.children.push_back(readme);
    }
    
    // Add files from file_list_ to the tree if they're not already there
    for (const auto& filename : file_list_) {
        bool found = false;
        for (const auto& child : root_folder_.children) {
            if (!child.is_folder && child.name == filename) {
                found = true;
                break;
            }
        }
        
