kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        if (!found) {
            FileNode file_node;
            file_node.name = filename;
            file_node.path = "/" + filename;
            file_node.is_folder = false;
            root_folder_.children.push_back(file_node);
        }
    }
}

void ImGuiWindow::RefreshPortList() {
    available_ports_.clear();
    
    if (serial_monitor_) {
        available_ports_ = serial_monitor_->GetAvailablePorts();
    }
    
    // Add some default ports if empty
    if (available_ports_.empty()) {
        available_ports_.push_back("/dev/ttyUSB0");
        available_ports_.push_back("/dev/ttyUSB1");
        available_ports_.push_back("COM3");
        available_ports_.push_back("COM4");
    }
    
    if (!available_ports_.empty() && selected_port_.empty()) {
        selected_port_index_ = 0;
        selected_port_ = available_ports_[0];
    }
}

void ImGuiWindow::LoadFile(const std::string& filename) {
    // Check if file is already open in a tab
    for (size_t i = 0; i < editor_tabs_.size(); i++) {
        if (editor_tabs_[i].filename == filename) {
            active_editor_tab_ = i;
            AddConsoleMessage("Switched to file: " + filename);
            return;
        }
    }
    
    // Create new tab
    EditorTab new_tab;
    new_tab.filename = filename;
    
    if (file_manager_ && file_manager_->FileExists(filename)) {
        new_tab.content = file_manager_->GetFileContent(filename);
    } else {
        new_tab.content = "// File: " + filename + "\n\n" + std::string(SIMPLE_SKETCH_TEMPLATE);
    }
    
    new_tab.is_modified = false;
    std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
    editor_tabs_.push_back(new_tab);
    active_editor_tab_ = editor_tabs_.size() - 1;
    
    line_count_dirty_ = true;
    
    if (text_editor_) {
        text_editor_->SetText(new_tab.content);
    }
    
    AddConsoleMessage("Loaded file: " + filename);
}

void ImGuiWindow::SaveFile() {
    SaveCurrentTab();
}

void ImGuiWindow::CompileCode() {
    AddConsoleMessage("=== Compilation Started ===");
    
    std::string code_to_compile;
    if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
        code_to_compile = editor_tabs_[active_editor_tab_].content;
        AddConsoleMessage("Compiling: " + editor_tabs_[active_editor_tab_].filename);
    } else {
        AddConsoleMessage("✗ No file open to compile");
        return;
    }
    
    if (compiler_) {
        auto result = compiler_->Compile(code_to_compile, compiler_->GetBoard());
        
        if (result.status == ESP32Compiler::CompileStatus::SUCCESS) {
            AddConsoleMessage("✓ Compilation successful!");
        } else {
            AddConsoleMessage("✗ Compilation failed!");
            for (const auto& error : result.errors) {
                AddConsoleMessage("  " + error);
            }
        }
    } else {
        AddConsoleMessage("Compiler not initialized");
    }
    
    AddConsoleMessage("=== Compilation Finished ===");
}

void ImGuiWindow::UploadCode() {
    AddConsoleMessage("=== Upload Started ===");
    AddConsoleMessage("Port: " + selected_port_);
    AddConsoleMessage("Baud rate: " + std::to_string(selected_baud_rate_));
    
    if (compiler_) {
        compiler_->Upload(compiler_->GetBoard());
        AddConsoleMessage("✓ Upload complete!");
    } else {
        AddConsoleMessage("Compiler not initialized");
    }
    
    AddConsoleMessage("=== Upload Finished ===");
}

void ImGuiWindow::DebugCode() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot start debugging: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button in the toolbar");
        return;
    }
    
    AddConsoleMessage("=== Debug Session Started ===");
    AddConsoleMessage("Connecting to ESP32 on " + selected_port_ + "...");
    AddConsoleMessage("Debug session active - use Debugger tab for controls");
    current_center_tab_ = 1; // Switch to debugger tab
}

void ImGuiWindow::ReverseEngineerCode() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot start reverse engineering: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button in the toolbar");
        return;
    }
    
    AddConsoleMessage("=== Reverse Engineering Analysis ===");
    AddConsoleMessage("Analyzing firmware structure...");
    AddConsoleMessage("Detecting functions and entry points...");
    AddConsoleMessage("Extracting strings and constants...");
    
    // Populate analysis results with simulated data
    // In a real implementation, this would analyze the actual device firmware
    re_analysis_result_.architecture = SAMPLE_RE_ARCHITECTURE;
    re_analysis_result_.flash_size = SAMPLE_RE_FLASH_SIZE;
    re_analysis_result_.entry_point = SAMPLE_RE_ENTRY_POINT;
    re_analysis_result_.functions_detected = SAMPLE_RE_FUNCTIONS_DETECTED;
    re_analysis_result_.strings_found = SAMPLE_RE_STRINGS_FOUND;
    re_analysis_result_.has_data = true;
    re_analysis_performed_ = true;
    
    AddConsoleMessage("✓ Analysis complete - see RE tab for details");
}

void ImGuiWindow::ConnectToDevice() {
    if (selected_port_.empty()) {
        AddConsoleMessage("⚠ No port selected. Please select a port first.");
        connection_attempted_ = true;
        is_connected_ = false;
        return;
    }
    
    AddConsoleMessage("=== Attempting Connection ===");
    AddConsoleMessage("Port: " + selected_port_);
    AddConsoleMessage("Baud rate: " + std::to_string(selected_baud_rate_));
    
    if (serial_monitor_) {
        bool success = serial_monitor_->Connect(selected_port_, selected_baud_rate_);
        is_connected_ = success;
        connection_attempted_ = true;
        
        if (success) {
            AddConsoleMessage("✓ Successfully connected to " + selected_port_);
        } else {
            AddConsoleMessage("✗ Failed to connect to " + selected_port_);
        }
    } else {
        is_connected_ = false;
        connection_attempted_ = true;
        AddConsoleMessage("✗ Serial monitor not initialized");
    }
}

void ImGuiWindow::DisconnectFromDevice() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ No device connected");
        return;
    }
    
