kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    // Add to chat history
    ai_chat_history_.push_back(std::make_pair(message, response));
    ai_scroll_to_bottom_ = true;
    
    AddConsoleMessage("AI: Responded to query about: " + message.substr(0, 50) + (message.length() > 50 ? "..." : ""));
}

void ImGuiWindow::AddConsoleMessage(const std::string& message) {
    console_messages_.push_back("[" + std::to_string(console_messages_.size()) + "] " + message);
    scroll_to_bottom_ = true;
}

void ImGuiWindow::SetupImGuiStyle() {
    ImGuiStyle& style = ImGui::GetStyle();
    
    // Dark theme colors
    ImVec4* colors = style.Colors;
    colors[ImGuiCol_Text]                   = ImVec4(1.00f, 1.00f, 1.00f, 1.00f);
    colors[ImGuiCol_TextDisabled]           = ImVec4(0.50f, 0.50f, 0.50f, 1.00f);
    colors[ImGuiCol_WindowBg]               = ImVec4(0.10f, 0.10f, 0.10f, 1.00f);
    colors[ImGuiCol_ChildBg]                = ImVec4(0.12f, 0.12f, 0.12f, 1.00f);
    colors[ImGuiCol_PopupBg]                = ImVec4(0.08f, 0.08f, 0.08f, 0.94f);
    colors[ImGuiCol_Border]                 = ImVec4(0.43f, 0.43f, 0.50f, 0.50f);
    colors[ImGuiCol_FrameBg]                = ImVec4(0.16f, 0.29f, 0.48f, 0.54f);
    colors[ImGuiCol_FrameBgHovered]         = ImVec4(0.26f, 0.59f, 0.98f, 0.40f);
    colors[ImGuiCol_FrameBgActive]          = ImVec4(0.26f, 0.59f, 0.98f, 0.67f);
    colors[ImGuiCol_TitleBg]                = ImVec4(0.04f, 0.04f, 0.04f, 1.00f);
    colors[ImGuiCol_TitleBgActive]          = ImVec4(0.16f, 0.29f, 0.48f, 1.00f);
    colors[ImGuiCol_MenuBarBg]              = ImVec4(0.14f, 0.14f, 0.14f, 1.00f);
    colors[ImGuiCol_ScrollbarBg]            = ImVec4(0.02f, 0.02f, 0.02f, 0.53f);
    colors[ImGuiCol_ScrollbarGrab]          = ImVec4(0.31f, 0.31f, 0.31f, 1.00f);
    colors[ImGuiCol_ScrollbarGrabHovered]   = ImVec4(0.41f, 0.41f, 0.41f, 1.00f);
    colors[ImGuiCol_ScrollbarGrabActive]    = ImVec4(0.51f, 0.51f, 0.51f, 1.00f);
    colors[ImGuiCol_CheckMark]              = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_SliderGrab]             = ImVec4(0.24f, 0.52f, 0.88f, 1.00f);
    colors[ImGuiCol_Button]                 = ImVec4(0.26f, 0.59f, 0.98f, 0.40f);
    colors[ImGuiCol_ButtonHovered]          = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_ButtonActive]           = ImVec4(0.06f, 0.53f, 0.98f, 1.00f);
    colors[ImGuiCol_Header]                 = ImVec4(0.26f, 0.59f, 0.98f, 0.31f);
    colors[ImGuiCol_HeaderHovered]          = ImVec4(0.26f, 0.59f, 0.98f, 0.80f);
    colors[ImGuiCol_HeaderActive]           = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_Tab]                    = ImVec4(0.18f, 0.35f, 0.58f, 0.86f);
    colors[ImGuiCol_TabHovered]             = ImVec4(0.26f, 0.59f, 0.98f, 0.80f);
    colors[ImGuiCol_TabActive]              = ImVec4(0.20f, 0.41f, 0.68f, 1.00f);
    
    // Rounding
    style.WindowRounding    = 0.0f;
    style.ChildRounding     = 0.0f;
    style.FrameRounding     = 3.0f;
    style.ScrollbarRounding = 3.0f;
    style.GrabRounding      = 3.0f;
    style.TabRounding       = 3.0f;
}

void ImGuiWindow::InsertCodeIntoEditor(const std::string& code) {
    if (!IsValidTabIndex(active_editor_tab_)) {
        AddConsoleMessage("⚠ No active editor tab to insert code into");
        return;
    }
    
    auto& tab = editor_tabs_[active_editor_tab_];
    
    // Check if code will fit in buffer (reserve space for null terminator)
    if (code.length() > EDITOR_BUFFER_SIZE - 1) {
        AddConsoleMessage("⚠ Code too large for buffer, truncating");
        tab.content = code.substr(0, EDITOR_BUFFER_SIZE - 1);
    } else {
        tab.content = code;
    }
    
    tab.is_modified = true;
    line_count_dirty_ = true;
    
    // Safely copy to buffer with size checking
    size_t safe_length = std::min(tab.content.length(), static_cast<size_t>(EDITOR_BUFFER_SIZE - 1));
    strncpy(tab.buffer, tab.content.c_str(), safe_length);
    tab.buffer[safe_length] = '\0';  // Ensure null termination
    
    // Update text editor if available
    if (text_editor_) {
        text_editor_->SetText(tab.content);
    }
    
    AddConsoleMessage("✓ Code inserted into " + tab.filename);
}

bool ImGuiWindow::IsValidTabIndex(int index) const {
    return !editor_tabs_.empty() && index >= 0 && index < static_cast<int>(editor_tabs_.size());
}

bool ImGuiWindow::ContainsCode(const std::string& text) const {
    return text.find(CODE_MARKER_SETUP) != std::string::npos ||
           text.find(CODE_MARKER_LOOP) != std::string::npos ||
           text.find(CODE_MARKER_INCLUDE) != std::string::npos;
}

void ImGuiWindow::RenderTerminalPanel() {
    ImGui::Text("Integrated Terminal");
    ImGui::Separator();
    
    // Terminal output
    ImGui::BeginChild("TerminalOutput", ImVec2(0, -30), true, ImGuiWindowFlags_HorizontalScrollbar);
    for (const auto& line : terminal_history_) {
        // Color code output
        if (line.find("Error:") != std::string::npos || line.find("error:") != std::string::npos) {
            ImGui::TextColored(ImVec4(1.0f, 0.3f, 0.3f, 1.0f), "%s", line.c_str());
        } else if (line.find("Warning:") != std::string::npos || line.find("warning:") != std::string::npos) {
            ImGui::TextColored(ImVec4(1.0f, 0.8f, 0.0f, 1.0f), "%s", line.c_str());
        } else if (line.find("$") == 0 || line.find(">") == 0) {
            ImGui::TextColored(ImVec4(0.3f, 1.0f, 0.3f, 1.0f), "%s", line.c_str());
        } else {
            ImGui::Text("%s", line.c_str());
        }
    }
    
    if (terminal_scroll_to_bottom_) {
        ImGui::SetScrollHereY(1.0f);
        terminal_scroll_to_bottom_ = false;
    }
    ImGui::EndChild();
    
    // Command input
    ImGui::PushItemWidth(-1);
    if (ImGui::InputText("##terminal_input", terminal_input_buffer_, sizeof(terminal_input_buffer_), 
                         ImGuiInputTextFlags_EnterReturnsTrue)) {
        std::string command(terminal_input_buffer_);
        if (!command.empty()) {
            ExecuteTerminalCommand(command);
            terminal_input_buffer_[0] = '\0';
            terminal_scroll_to_bottom_ = true;
        }
    }
    ImGui::PopItemWidth();
}

void ImGuiWindow::ExecuteTerminalCommand(const std::string& command) {
    terminal_history_.push_back("$ " + command);
    
    if (command == "help") {
        terminal_history_.push_back("Available commands:");
        terminal_history_.push_back("  help     - Show this help message");
        terminal_history_.push_back("  clear    - Clear terminal output");
        terminal_history_.push_back("  compile  - Compile current code");
        terminal_history_.push_back("  upload   - Upload code to device");
        terminal_history_.push_back("  ports    - List available serial ports");
        terminal_history_.push_back("  boards   - List detected boards");
        terminal_history_.push_back("  ls       - List files in project");
    } else if (command == "clear") {
        terminal_history_.clear();
        terminal_history_.push_back("Terminal cleared");
    } else if (command == "compile") {
        terminal_history_.push_back("Compiling code...");
        CompileCode();
        terminal_history_.push_back("Compilation complete - check console for details");
    } else if (command == "upload") {
        terminal_history_.push_back("Uploading code to device...");
        UploadCode();
        terminal_history_.push_back("Upload complete - check console for details");
    } else if (command == "ports") {
        terminal_history_.push_back("Available serial ports:");
        if (available_ports_.empty()) {
            terminal_history_.push_back("  (none found)");
        } else {
            for (const auto& port : available_ports_) {
                terminal_history_.push_back("  " + port);
            }
        }
    } else if (command == "boards") {
        terminal_history_.push_back("Detected boards:");
        if (detected_boards_.empty()) {
            terminal_history_.push_back("  (none found - run 'ports' to scan)");
        } else {
            for (const auto& board : detected_boards_) {
                terminal_history_.push_back("  " + board.name + " - " + board.chip + " @ " + board.port);
            }
        }
    } else if (command == "ls") {
        terminal_history_.push_back("Project files:");
        for (const auto& file : file_list_) {
            terminal_history_.push_back("  " + file);
        }
    } else {
        terminal_history_.push_back("Error: Unknown command '" + command + "'");
        terminal_history_.push_back("Type 'help' for available commands");
    }
}

void ImGuiWindow::RenderBoardListPanel() {
    ImGui::Text("Detected Boards");
    ImGui::Separator();
    
    if (ImGui::Button("Scan for Boards")) {
        RefreshBoardList();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Show Schematic")) {
        show_device_schematic_ = !show_device_schematic_;
    }
    
    ImGui::Separator();
    
    if (detected_boards_.empty()) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "No boards detected");
        ImGui::TextWrapped("Click 'Scan for Boards' to detect connected ESP32 devices");
    } else {
        ImGui::Text("Found %d board(s):", static_cast<int>(detected_boards_.size()));
        ImGui::Spacing();
        
