kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        for (size_t i = 0; i < detected_boards_.size(); i++) {
            const auto& board = detected_boards_[i];
            
            ImGui::PushID(i);
            bool is_selected = (static_cast<int>(i) == selected_board_index_);
            
            if (ImGui::Selectable(board.name.c_str(), is_selected)) {
                selected_board_index_ = static_cast<int>(i);
            }
            
            if (is_selected) {
                ImGui::Indent();
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Chip: %s", board.chip.c_str());
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Port: %s", board.port.c_str());
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Flash: %d MB", board.flash_size_mb);
                ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "RAM: %d KB", board.ram_size_kb);
                
                if (board.is_connected) {
                    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
                } else {
                    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "Not connected");
                }
                ImGui::Unindent();
            }
            
            ImGui::PopID();
        }
    }
}

void ImGuiWindow::RefreshBoardList() {
    AddConsoleMessage("Scanning for ESP32 boards...");
    
    // Clear existing boards
    detected_boards_.clear();
    
    // Scan ports and try to detect board information
    RefreshPortList();
    
    for (const auto& port : available_ports_) {
        BoardInfo board;
        board.port = port;
        board.is_connected = (port == selected_port_ && is_connected_);
        
        // NOTE: This is a simplified board detection based on port name patterns.
        // In a production implementation, this should:
        // 1. Query the device via serial for chip ID (using esptool.py protocol)
        // 2. Read manufacturer/product strings from USB descriptors
        // 3. Use vendor ID (VID) and product ID (PID) to identify ESP32 devices
        // Current heuristic-based approach may incorrectly identify non-ESP32 devices.
        
        // ESP32 boards typically use CP2102, CH340, or FTDI USB-to-serial chips
        if (port.find("ttyUSB") != std::string::npos || port.find("USB") != std::string::npos) {
            board.name = "ESP32-DevKit";
            board.chip = "ESP32";
            board.flash_size_mb = 4;
            board.ram_size_kb = 520;
        } else if (port.find("ttyACM") != std::string::npos || port.find("ACM") != std::string::npos) {
            board.name = "ESP32-S3-DevKit";
            board.chip = "ESP32-S3";
            board.flash_size_mb = 8;
            board.ram_size_kb = 512;
        } else {
            // Default fallback for unrecognized ports
            board.name = "ESP32 Board";
            board.chip = "ESP32";
            board.flash_size_mb = 4;
            board.ram_size_kb = 520;
        }
        
        detected_boards_.push_back(board);
    }
    
    AddConsoleMessage("✓ Found " + std::to_string(detected_boards_.size()) + " board(s)");
}

void ImGuiWindow::RenderDeviceSchematic() {
    ImGui::Text("ESP32 Device Schematic");
    ImGui::Separator();
    
    // View selector
    if (ImGui::BeginTabBar("SchematicTabs")) {
        if (ImGui::BeginTabItem("Pinout")) {
            current_schematic_view_ = 0;
            
            ImGui::TextWrapped("ESP32 DevKit Pinout Diagram");
            ImGui::Separator();
            
            // Draw a simple text-based pinout (in a real app, this would be an image or vector graphics)
            ImGui::BeginChild("Pinout", ImVec2(0, 0), true);
            
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Left Side:");
            ImGui::Text("EN          - Enable (Reset)");
            ImGui::Text("VP (GPIO36) - Analog Input Only");
            ImGui::Text("VN (GPIO39) - Analog Input Only");
            ImGui::Text("GPIO34      - Analog Input Only");
            ImGui::Text("GPIO35      - Analog Input Only");
            ImGui::Text("GPIO32      - ADC1_CH4, Touch9");
            ImGui::Text("GPIO33      - ADC1_CH5, Touch8");
            ImGui::Text("GPIO25      - ADC2_CH8, DAC1");
            ImGui::Text("GPIO26      - ADC2_CH9, DAC2");
            ImGui::Text("GPIO27      - ADC2_CH7, Touch7");
            ImGui::Text("GPIO14      - ADC2_CH6, Touch6");
            ImGui::Text("GPIO12      - ADC2_CH5, Touch5");
            ImGui::Spacing();
            
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Right Side:");
            ImGui::Text("GPIO23      - VSPI MOSI");
            ImGui::Text("GPIO22      - I2C SCL");
            ImGui::Text("TX (GPIO1)  - UART0 TX");
            ImGui::Text("RX (GPIO3)  - UART0 RX");
            ImGui::Text("GPIO21      - I2C SDA");
            ImGui::Text("GPIO19      - VSPI MISO");
            ImGui::Text("GPIO18      - VSPI SCK");
            ImGui::Text("GPIO5       - VSPI CS");
            ImGui::Text("GPIO17      - UART2 TX");
            ImGui::Text("GPIO16      - UART2 RX");
            ImGui::Text("GPIO4       - ADC2_CH0, Touch0");
            ImGui::Text("GPIO2       - ADC2_CH2, Touch2, LED");
            ImGui::Text("GPIO15      - ADC2_CH3, Touch3");
            
            ImGui::Spacing();
            ImGui::Separator();
            ImGui::TextColored(ImVec4(1.0f, 0.8f, 0.0f, 1.0f), "Power Pins:");
            ImGui::Text("3.3V        - 3.3V Power Output");
            ImGui::Text("GND         - Ground (multiple pins)");
            ImGui::Text("VIN         - 5V Power Input");
            
            ImGui::EndChild();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Block Diagram")) {
            current_schematic_view_ = 1;
            
            ImGui::TextWrapped("ESP32 System Architecture");
            ImGui::Separator();
            
            ImGui::BeginChild("BlockDiagram", ImVec2(0, 0), true);
            
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "CPU:");
            ImGui::BulletText("Dual-core Xtensa LX6 @ 240 MHz");
            ImGui::BulletText("448 KB ROM");
            ImGui::BulletText("520 KB SRAM");
            ImGui::Spacing();
            
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Wireless:");
            ImGui::BulletText("WiFi 802.11 b/g/n (2.4 GHz)");
            ImGui::BulletText("Bluetooth v4.2 BR/EDR + BLE");
            ImGui::Spacing();
            
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Peripherals:");
            ImGui::BulletText("34 GPIO pins");
            ImGui::BulletText("18 ADC channels (12-bit)");
            ImGui::BulletText("2 DAC channels (8-bit)");
            ImGui::BulletText("10 Touch sensors");
            ImGui::BulletText("3 UART interfaces");
            ImGui::BulletText("3 SPI interfaces");
            ImGui::BulletText("2 I2C interfaces");
            ImGui::BulletText("16 PWM channels");
            ImGui::BulletText("SD/SDIO/MMC host");
            ImGui::BulletText("Ethernet MAC");
            ImGui::Spacing();
            
