kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
            ImGui::TextColored(ImVec4(0.3f, 0.8f, 1.0f, 1.0f), "Security:");
            ImGui::BulletText("Secure boot");
            ImGui::BulletText("Flash encryption");
            ImGui::BulletText("Hardware crypto acceleration");
            
            ImGui::EndChild();
            ImGui::EndTabItem();
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderSyntaxHighlightedText(const std::string& code) {
    if (!enable_syntax_highlighting_ || !syntax_highlighter_) {
        // Fallback to plain text
        ImGui::TextUnformatted(code.c_str());
        return;
    }
    
    // Tokenize and render with colors
    auto tokens = syntax_highlighter_->Tokenize(code);
    
    for (const auto& token : tokens) {
        ImVec4 color(1.0f, 1.0f, 1.0f, 1.0f); // Default white
        
        switch (token.type) {
            case SyntaxHighlighter::TokenType::KEYWORD:
                color = ImVec4(0.8f, 0.3f, 0.8f, 1.0f); // Purple
                break;
            case SyntaxHighlighter::TokenType::TYPE:
                color = ImVec4(0.3f, 0.8f, 0.8f, 1.0f); // Cyan
                break;
            case SyntaxHighlighter::TokenType::FUNCTION:
                color = ImVec4(0.8f, 0.8f, 0.3f, 1.0f); // Yellow
                break;
            case SyntaxHighlighter::TokenType::STRING:
                color = ImVec4(0.8f, 0.5f, 0.3f, 1.0f); // Orange
                break;
            case SyntaxHighlighter::TokenType::COMMENT:
                color = ImVec4(0.4f, 0.8f, 0.4f, 1.0f); // Green
                break;
            case SyntaxHighlighter::TokenType::NUMBER:
                color = ImVec4(0.5f, 0.8f, 1.0f, 1.0f); // Light blue
                break;
            case SyntaxHighlighter::TokenType::PREPROCESSOR:
                color = ImVec4(0.8f, 0.4f, 0.4f, 1.0f); // Red
                break;
            case SyntaxHighlighter::TokenType::OPERATOR:
            case SyntaxHighlighter::TokenType::IDENTIFIER:
            case SyntaxHighlighter::TokenType::WHITESPACE:
            default:
                color = ImVec4(0.9f, 0.9f, 0.9f, 1.0f); // Light gray
                break;
        }
        
        ImGui::TextColored(color, "%s", token.text.c_str());
        
        // Handle line breaks properly - if token contains newline, don't use SameLine
        if (token.text.find('\n') == std::string::npos) {
            ImGui::SameLine(0, 0);
        }
        // If token ends with newline, the next token will naturally start on new line
    }
}

void ImGuiWindow::RenderBlueprintTab() {
    ImGui::Text("Blueprint Node Editor");
    ImGui::Separator();
    
    // Toolbar for blueprint actions
    if (ImGui::Button("Clear All")) {
        if (blueprint_editor_) {
            blueprint_editor_->Clear();
        }
    }
    ImGui::SameLine();
    if (ImGui::Button("Generate Code")) {
        if (blueprint_editor_) {
            std::string generated_code = blueprint_editor_->GenerateCode();
            AddConsoleMessage("Generated code from blueprint:");
            AddConsoleMessage(generated_code);
        }
    }
    ImGui::SameLine();
    ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), 
                      "Right-click in empty space to add nodes");
    
    ImGui::Separator();
    
    // Render the blueprint editor
    if (blueprint_editor_) {
        blueprint_editor_->Render();
    } else {
        ImGui::TextColored(ImVec4(1.0f, 0.3f, 0.3f, 1.0f), 
                          "Blueprint editor failed to initialize");
    }
}

} // namespace gui
} // namespace esp32_ide
